"""
Дана строка. Вывести строку, содержащую те же символы, но расположенные в
обратном порядке.
"""
stroca = str(input("Введите строку: "))
print(stroca[:: -1])